import networkx as nx
import matplotlib.pyplot as plt

# Створення графу
G = nx.Graph()

# Додавання вершин (зупинок)
stops = [
    "Боярка", "Дубенське кладовище",
    "Аграрний технікум", "Пивзавод",
    "Центральний ринок", "Театральна",
    "Центр", "Соборна",
    "12 школа", "Богдана Хмельницького",
    "3 поліклініка", "Чайка",
    "Князя Романа", "Соборна",
    "Льонокомбінатівська", "Льонокомбінат",
    "Зустріч", "Коновальця",
    "Північний", "Альтернативна 1",
    "Альтернативна 2", "Альтернативна 3",
]
G.add_nodes_from(stops)

# Додавання ребер (маршрутів між зупинками)
edges = [
    ("Боярка", "Дубенське кладовище", 10),
    ("Дубенське кладовище", "Аграрний технікум", 10),
    ("Аграрний технікум", "Пивзавод", 10),
    ("Пивзавод", "Центральний ринок", 10),
    ("Центральний ринок", "Театральна", 10),
    ("Театральна", "Альтернативна 1", 5),
    ("Альтернативна 1", "Альтернативна 2", 5),
    ("Альтернативна 2", "Альтернативна 3", 5),
    ("Альтернативна 3", "3 поліклініка", 10),
    ("Театральна", "Центр", 10),
    ("Центр", "Соборна", 10),
    ("Соборна", "12 школа", 10),
    ("12 школа", "Богдана Хмельницького", 10),
    ("Богдана Хмельницького", "3 поліклініка", 10),
    ("3 поліклініка", "Чайка", 10),
    ("Чайка", "Князя Романа", 10),
    ("Князя Романа", "Льонокомбінатівська", 10),
    ("Льонокомбінатівська", "Льонокомбінат", 10),
    ("Чайка", "Зустріч", 10),
    ("Зустріч", "Коновальця", 10),
    ("Коновальця", "Північний", 10),
]
G.add_weighted_edges_from(edges)

# Візуалізація графу
plt.figure(figsize=(12, 12))
nx.draw(G, with_labels=True, node_color="skyblue", node_size=700, edge_color="k", linewidths=1, font_size=15, font_weight="bold")
plt.title("Транспортна мережа тролейбусних зупинок міста Рівне для тролейбусів 2 та 7")
plt.show()

# Аналіз основних характеристик мережі
num_nodes = G.number_of_nodes()
num_edges = G.number_of_edges()
degrees = [degree for node, degree in nx.degree(G)]

print(f"{num_nodes}")
print(f"{num_edges}")
print(f"{degrees}")